/**
 * 
 * 함수와 객체를 사용하기!
 * 
 * 음료 자판기가 존재합니다.
 * 
 * 자판기에서 선택 가능한 음료는 아래와 같습니다.
 * 
 * 사이다 1000
 * 콜라 1000
 * 닥터페퍼 1500
 * 환타 1500
 * 
 * 만약 없는 메뉴를 선택하면 "존재하지 않는 메뉴입니다"를 출력하고 투입 금액 반환.
 * 만약 투입 금액보다 선택한 음료 가격이 더 비싸다면 "요금이 부족합니다"를 출력하고 투입 금액 출력.
 * 투입 금액보다 선택한 음료 값이 더 싸다면 "음료명, 잔돈 0000원"출력
 * 만약 값이 동일하다면 음료명만 출력
 * 
 * 
 * input 
 * 1000, 콜라
 * 1500, 사이다
 * 500, 환타
 * 500, 솔의눈
 * 
 * output 
 * 콜라
 * 사이다, 500
 * 요금이 부족합니다. 500
 * 존재하지 않는 메뉴입니다. 500
 * 
 * 
 */

// 특정한 집단에서 무언가를 선택해야한다 -> 객체, 배열
// 객체는 하나의 추상화되는 무언가(사물)


// level 1 에 80% 정답 퀴즈정도?


function VM(drink, coin){

    // menu.drink
    // menu[drink]  ---> ex seongyong["age"] === seongyong.age   key를 넣으면 value 가 나온다.
    // const price = "음료가격"
    // const charge
    if(!price){
        return console.log('존재하지 않는 메뉴입니다.', coin1)
    }

}

VM('콜라', 1000)



















